# YOLO 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, GOEBlock, [64]]
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]] # ---v5
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]] # ----v5
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]] # ----v5
  - [-1, 1, Conv, [1024,3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]] # ----v5
  - [-1, 1, SPPF, [1024, 5]] # 10

# YOLO head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # ----14

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, HKC3k, [256,1, False, 1, 0.5, 3, 3]] # --20
  - [-1, 3, C3, [256, False]] # ----v5


  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 1, HKC3k, [512,1, False, 1, 0.5, 3, 5]] # --24
  - [-1, 3, C3, [512, False]] # ----v5 


  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, HKC3k, [1024,1, False, 1, 0.5, 3, 7]]
  - [-1, 3, C3, [1024, False]] # ----v5


  - [[19, 23, -1], 1, Segment, [nc, anchors, 32, 256]] # Detect(P3, P4, P5)